{
  "name": "Gerbera",
  "desc": "Deploy Gerbera with a straightforward setup to create a powerful UPnP media server. Gerbera allows users to stream and manage their digital media across a variety of devices on a home network.",
  "longDesc": "**What is Gerbera?**\n\nGerbera is an open-source media server that implements the UPnP (Universal Plug and Play) AV (Audio/Video) protocol. It enables users to share and stream media content across different devices such as smart TVs, game consoles, and mobile devices.\n\n**Key Features:**\n\n- **One-Click Deployment:** Quick installation via Docker, facilitating easy access to media server functionalities.\n- **Scalability:** Efficiently manages a large library of media files, suitable for personal collections or community sharing.\n- **Privacy:** Keeps media content local, allowing users to maintain full control over their data without relying on cloud services.\n- **Plugin Support:** Extend functionality with various plugins to enhance streaming and management capabilities.\n- **Web Interface:** Provides an intuitive web-based interface for managing media libraries and settings.",
  "useCases": "- **Home Users:** Stream personal media collections to various devices within the home.\n- **Educational Institutions:** Share educational videos and resources within classrooms or departments.\n- **Media Enthusiasts:** Organize and manage extensive media libraries with easy access to playback options.",
  "support": "- **Community Forums:** Connect with other users for assistance and discussions through the [Gerbera Forum](https://github.com/gerbera/gerbera).\n- **Documentation:** Comprehensive user guides and configuration tips are available at the [Gerbera Documentation](https://docs.gerbera.io/en/stable/).\n- **Troubleshooting Help:** Access resources for troubleshooting common issues during setup and operation.\n\n This template provides an overview of Gerbera’s functionalities, emphasizing its capabilities for effective media management and streaming. For more information, visit the [official Gerbera website](https://gerbera.io/).",
  "tags": ["Media Streaming - Multimedia Streaming"],
  "website": "https://docs.gerbera.io/",
  "implemented": false,
  "logo": "",
  "specs": {
    "ram": 0,
    "storage": 0
  },
  "nixName": "gerbera",
  "options": [
    {
      "name": "misc/mediatomb.nix",
      "desc": "The gerbera package to use.",
      "nixName": "relatedOption.mediatomb.package",
      "type": "package",
      "value": "pkgs.gerbera"
    },
    {
      "name": "misc/mediatomb.nix",
      "desc": "Whether to enable the Gerbera/Mediatomb DLNA server.",
      "nixName": "relatedOption.mediatomb.enable",
      "type": "boolean",
      "value": "false"
    },
    {
      "name": "misc/mediatomb.nix",
      "desc": "The directory where Gerbera/Mediatomb stores its state, data,etc.",
      "nixName": "relatedOption.mediatomb.dataDir",
      "type": "path",
      "value": "\"/var/lib/${config.services.mediatomb.package.pname}\""
    },
    {
      "name": "misc/mediatomb.nix",
      "desc": "Allow the service to create and use its own config file inside thedataDir as configured by services.mediatomb.dataDir. Deactivated by default,the service then runs with the configuration generated from this module.Otherwise, when enabled, no service configuration is generated.Gerbera/Mediatomb then starts using config.xml within the configureddataDir. It’s up to the user to make a correctconfiguration file.",
      "nixName": "relatedOption.mediatomb.customCfg",
      "type": "boolean",
      "value": "false"
    }
  ]
}
