{
  "name": "Rygel",
  "desc": "Deploy Rygel with a streamlined setup to create a powerful UPnP (Universal Plug and Play) media server. Rygel allows users to stream and share digital media content across devices in a home network seamlessly.",
  "longDesc": "Rygel is an open-source UPnP media server that provides a framework for streaming multimedia content. It supports various media formats and allows users to share and access their media libraries on different devices within their network.\n\n**Key Features:**\n- **One-Click Deployment:** Simplified installation via Docker, enabling quick setup and access to media streaming capabilities.\n- **Scalability:** Efficiently handles large libraries of media files, making it suitable for both personal collections and shared media servers.\n- **Privacy:** Users maintain control over their media, as all content is hosted locally without reliance on cloud services.\n- **API Compatibility:** Provides a UPnP AV API for easy integration with various devices and applications.\n- **Flexible Media Handling:** Supports transcoding and streaming of various media formats, allowing playback on a wide range of devices.",
  "useCases": "- **Home Users:** Stream personal music, videos, and photos to smart TVs, gaming consoles, or mobile devices.\n- **Media Enthusiasts:** Share large media collections with friends and family across the home network.\n- **Educators:** Use Rygel to present multimedia content in classrooms or workshops, facilitating collaborative learning experiences.",
  "support": "- **Community Forums:** Connect with other Rygel users and developers through the [Rygel GitLab Page](https://gitlab.gnome.org/GNOME/rygel) for assistance and discussions.\n- **Documentation:** Access comprehensive guides, configuration options, and troubleshooting tips at the [Rygel Documentation](https://wiki.gnome.org/Projects/Rygel).\n- **Troubleshooting Help:** Review the [Rygel GitHub Repository](https://gitlab.gnome.org/GNOME/rygel/issues) for common issues and solutions provided by the community.\n\nThis template highlights Rygel’s capabilities for media streaming and sharing, emphasizing its role within home networks. For more detailed information, visit the [official Rygel website](https://wiki.gnome.org/Projects/Rygel).",
  "tags": ["Media Streaming - Multimedia Streaming"],
  "website": "https://gitlab.gnome.org/GNOME/rygel",
  "implemented": false,
  "logo": "https://gitlab.gnome.org/uploads/-/system/appearance/favicon/1/GnomeLogoVertical.svg.png",
  "specs": {
    "ram": 0,
    "storage": 0
  },
  "nixName": "gnome.rygel",
  "options": [
    {
      "name": "desktops/gnome/rygel.nix",
      "desc": "Whether to enable Rygel UPnP Mediaserver.You will need to also allow UPnP connections in firewall, see thefollowing comment.",
      "nixName": "enable",
      "type": "boolean",
      "value": "false"
    }
  ]
}
