{
  "name": "Hound",
  "desc": "Deploy Hound with a streamlined setup to create a lightning-fast source code search engine. Hound indexes repositories and provides quick search capabilities for developers to efficiently find code snippets, definitions, and other essential data across their codebase.",
  "longDesc": "Hound is an open-source tool designed for fast and efficient searching of source code. Built on a robust architecture, it allows users to index and query code repositories quickly, improving productivity and code management.\n\n**Key Features:**\n- **One-Click Deployment:** Simplified installation process via Docker, allowing for quick and easy setup of the search service.\n- **Scalability:** Capable of indexing a large number of repositories and handling significant search loads, suitable for small teams and large enterprises.\n- **Privacy and Security:** Maintains user data security by hosting the indexing service locally, minimizing reliance on third-party platforms.\n- **API Compatibility:** Provides a minimal API for integration with other development tools, facilitating seamless workflows.\n- **User-Friendly Interface:** Offers an intuitive web interface that allows users to perform searches and navigate through code efficiently.",
  "useCases": "- **Developers:** Quickly search through large codebases to find functions, classes, or comments, improving code comprehension and debugging efficiency.\n- **Enterprises:** Manage multiple repositories and streamline code review processes by providing easy access to code across teams.\n- **Educators:** Teach software development concepts by allowing students to explore and search through example codebases.",
  "support": "- **Community Forums:** Engage with other Hound users through the [Hound GitHub Repository](https://github.com/hound-search/hound) for discussions and support.\n- **Documentation:** Comprehensive setup guides and user instructions are available in the [Hound Documentation](https://github.com/hound-search/hound) for detailed reference.\n- **Troubleshooting Help:** Access the issues section on GitHub to report bugs and find solutions provided by the developer community.\n\nThis template highlights Hound's capabilities for efficient source code searching, emphasizing its importance for developers and teams. For more detailed information, visit the [official Hound GitHub page](https://github.com/hound-search/hound).",
  "nixName": "hound",
  "specs": {
    "ram": 0,
    "storage": 0
  },
  "tags": ["Search Engines"],
  "website": "https://github.com/hound-search/hound",
  "implemented": false,
  "logo": "",
  "options": [
    {
      "name": "enable",
      "desc": "Whether to enable hound.",
      "nixName": "enable",
      "type": "boolean",
      "value": "true"
    },
    {
      "name": "group",
      "desc": "Group the hound daemon should execute under.",
      "nixName": "group",
      "type": "string",
      "value": "hound"
    },
    {
      "name": "home",
      "desc": "The path to use as hound’s $HOME. If the default user “hound” is configured then this is the home of the “hound” user.",
      "nixName": "home",
      "type": "path",
      "value": "\"/var/lib/hound\""
    },
    {
      "name": "listen",
      "desc": "Listen on this [IP]:port",
      "nixName": "listen",
      "type": "string",
      "value": "0.0.0.0:6080"
    },
    {
      "name": "package",
      "desc": "The hound package to use.",
      "nixName": "package",
      "type": "package",
      "value": "pkgs.hound"
    },
    {
      "name": "settings",
      "desc": "The full configuration of the Hound daemon. See the upstream documentation https://github.com/hound-search/hound/blob/main/docs/config-options.md for details.  The dbpath should be an absolute path to a writable directory.",
      "nixName": "settings",
      "type": "JSON value",
      "value": ""
    },
    {
      "name": "user",
      "desc": "User the hound daemon should execute under.",
      "nixName": "user",
      "type": "string",
      "value": "hound"
    }
  ]
}
