{
  "name": "Kodi",
  "desc": "Deploy Kodi to create a powerful, open-source media center application that allows users to play and view movies, music, podcasts, and other digital media files from local and network storage media.",
  "longDesc": "Kodi is a free and open-source media player and entertainment hub designed to provide a seamless multimedia experience. It supports various file formats and can stream content from local storage, networks, and online services.\n\n**Key Features:**\n- **One-Click Deployment:** Easily deploy Kodi using Docker or other containerization methods for quick installation and setup.\n- **Scalability:** Designed to work on a variety of devices, from smartphones to smart TVs and computers, making it versatile for different user environments.\n- **Privacy and Security:** Offers features like a built-in VPN option for secure streaming, ensuring user privacy while accessing content.\n- **API Compatibility:** Provides an extensive API for integration with third-party services and add-ons, allowing users to customize their Kodi experience.\n- **Wide Format Support:** Supports a large number of audio, video, and image formats, ensuring compatibility with various media types.",
  "useCases": "- **Home Entertainment:** Set up Kodi as a central hub for all media consumption, allowing family members to access movies, shows, and music easily.\n- **Developers:** Create and share custom add-ons to extend Kodi's functionality and improve user experiences.\n- **Educators:** Use Kodi to create engaging multimedia presentations, integrating various media types into teaching materials.",
  "support": "- **Community Forums:** Engage with the Kodi community for support and discussions through the [Kodi Community Forum](https://forum.kodi.tv/).\n- **Documentation:** Comprehensive guides and user manuals are available at the [Kodi Documentation](https://kodi.wiki/) for detailed reference.\n- **Troubleshooting Help:** Access the [Kodi GitHub Repository](https://github.com/xbmc/xbmc) to report bugs and find community-contributed solutions.\n\nThis template provides an overview of Kodi’s functionalities and practical applications, emphasizing its role as a versatile media center. For more detailed information, visit the [official Kodi website](https://kodi.tv/).",
  "tags": ["Media Streaming - Multimedia Streaming"],
  "website": "https://kodi.tv/",
  "implemented": false,
  "logo": "https://kodi.tv/favicon-32x32.png?v=0f7311d6dfc6bbfa30848b0c28f33af2",
  "specs": {
    "ram": 0,
    "storage": 0
  },
  "nixName": "kodi",
  "options": [
    {
      "name": "x11/desktop-managers/kodi.nix",
      "desc": "The kodi package to use.",
      "nixName": "relatedOption.xserver.desktopManager.kodi.package",
      "type": "package",
      "value": "pkgs.kodi"
    },
    {
      "name": "x11/desktop-managers/kodi.nix",
      "desc": "Enable the kodi multimedia center.",
      "nixName": "relatedOption.xserver.desktopManager.kodi.enable",
      "type": "boolean",
      "value": "false"
    }
  ]
}
