{
  "name": "Libreddit",
  "desc": "Deploy Libreddit to create a privacy-focused, open-source alternative to Reddit. Libreddit allows users to engage in discussions, share content, and connect with communities without the tracking and advertisements associated with traditional social media platforms.",
  "longDesc": "Libreddit is a self-hosted web application that provides a Reddit-like experience with an emphasis on user privacy and data ownership. It offers the core functionalities of Reddit while removing advertisements and tracking mechanisms.\n\n**Key Features:**\n- **One-Click Deployment:** Easily deploy Libreddit using Docker or other containerization options for quick installation.\n- **Scalability:** Designed to handle numerous users and posts, making it suitable for both personal and larger community applications.\n- **Privacy and Security:** Ensures user data is not sold or shared with third parties, providing a secure platform for discussions.\n- **API Compatibility:** Offers an API for integration with other applications, enabling custom features and functionalities.\n- **Customizable Interface:** Users can modify the appearance and features to better suit their community's needs.",
  "useCases": "- **Community Managers:** Create and manage forums or communities that prioritize user privacy and engagement without commercial influence.\n- **Developers:** Integrate Libreddit into existing platforms or build custom applications that leverage its functionality.\n- **Educators:** Use Libreddit as a platform for academic discussions and resource sharing in a controlled and private environment.",
  "support": "- **Community Forums:** Engage with the Libreddit community for support and discussions through the [Libreddit GitHub Repository](https://github.com/libreddit/libreddit).\n- **Documentation:** Comprehensive guides and user manuals are available in the repository for detailed reference on setup and configuration.\n- **Troubleshooting Help:** Access the issues section on GitHub to report bugs and find community-contributed solutions.\n\nThis template provides an overview of Libreddit’s functionalities and practical applications, emphasizing its role in promoting privacy in social media interactions. For more detailed information, visit the [official Libreddit GitHub page](https://github.com/libreddit/libreddit).",
  "nixName": "libreddit",
  "specs": {
    "ram": 1024,
    "storage": 1024
  },
  "tags": ["Communication - Social Networks and Forums"],
  "website": "https://github.com/redlib-org/redlib",
  "implemented": false,
  "logo": "",
  "options": [
    {
      "name": "address",
      "desc": "The address to listen on",
      "nixName": "address",
      "type": "string",
      "value": "\"0.0.0.0\""
    },
    {
      "name": "enable",
      "desc": "Whether to enable Private front-end for Reddit.",
      "nixName": "enable",
      "type": "boolean",
      "value": "true"
    },
    {
      "name": "openFirewall",
      "desc": "Open ports in the firewall for the libreddit web interface",
      "nixName": "openFirewall",
      "type": "boolean",
      "value": "true"
    },
    {
      "name": "package",
      "desc": "The libreddit package to use.",
      "nixName": "package",
      "type": "package",
      "value": "pkgs.libreddit"
    },
    {
      "name": "port",
      "desc": "The port to listen on",
      "nixName": "port",
      "type": "16 bit unsigned integer; between 0 and 65535 (both inclusive)",
      "value": "8080"
    }
  ]
}
