{
  "name": "Lidarr is a music collection manager for Usenet and BitTorrent users.",
  "desc": "Deploy Lidarr to manage and automate the downloading of music. Lidarr provides users with a powerful tool to track, manage, and collect their music libraries seamlessly.",
  "longDesc": "Lidarr is an open-source music collection manager designed to work similarly to Sonarr and Radarr, focusing on downloading and organizing music files from various sources automatically.\n\n**Key Features:**\n- **One-Click Deployment:** Easily set up Lidarr using Docker or other package managers for a straightforward installation process.\n- **Scalability:** Capable of managing large music libraries and supporting multiple users, making it ideal for both personal collections and shared environments.\n- **Privacy and Security:** Operates locally to keep user data secure, ensuring that music files and metadata are not shared with third-party services without consent.\n- **API Compatibility:** Offers an extensive API for integration with other applications, allowing for automation and enhanced functionality.\n- **Automatic Metadata Management:** Downloads and organizes music metadata, including album artwork, track listings, and more.",
  "useCases": "- **Music Enthusiasts:** Use Lidarr to automate the management of music collections, ensuring that libraries are always up to date with the latest releases.\n- **DJs and Producers:** Manage extensive music libraries efficiently, making it easier to access tracks for performances.\n- **Developers:** Integrate Lidarr into music-related applications to enhance user experience with automated music management.",
  "support": "- **Community Forums:** Engage with the Lidarr community for support and discussions through the [Lidarr GitHub Repository](https://github.com/Lidarr/Lidarr).\n- **Documentation:** Comprehensive guides and user manuals are available at the [Lidarr Documentation](https://wiki.servarr.com/lidarr) for detailed reference.\n- **Troubleshooting Help:** Access the issues section on GitHub to report bugs and find community-contributed solutions.\n\nThis template provides an overview of Lidarr’s functionalities and practical applications, emphasizing its role in music management. For more detailed information, visit the [official Lidarr website](https://lidarr.audio/).",
  "nixName": "lidarr",
  "specs": {
    "ram": 2048,
    "storage": 20480
  },
  "tags": ["Automation"],
  "website": "https://lidarr.audio/",
  "implemented": false,
  "logo": "https://lidarr.audio/img/favicon.ico",
  "options": [
    {
      "name": "dataDir",
      "desc": "The directory where Lidarr stores its data files.",
      "nixName": "dataDir",
      "type": "string",
      "value": "/var/lib/lidarr/.config/Lidarr"
    },
    {
      "name": "enable",
      "desc": "Whether to enable Lidarr, a Usenet/BitTorrent music downloader.",
      "nixName": "enable",
      "type": "boolean",
      "value": "true"
    },
    {
      "name": "group",
      "desc": "Group under which Lidarr runs.",
      "nixName": "group",
      "type": "string",
      "value": "lidarr"
    },
    {
      "name": "openFirewall",
      "desc": "Open ports in the firewall for Lidarr",
      "nixName": "openFirewall",
      "type": "boolean",
      "value": "false"
    },
    {
      "name": "package",
      "desc": "The lidarr package to use.",
      "nixName": "package",
      "type": "package",
      "value": "pkgs.lidarr"
    },
    {
      "name": "user",
      "desc": "User account under which Lidarr runs.",
      "nixName": "user",
      "type": "string",
      "value": "lidarr"
    }
  ]
}
