{
  "name": "Manticore Search",
  "desc": "Deploy Manticore Search to implement a powerful, open-source full-text search engine optimized for speed and scalability. Manticore Search provides users with advanced search capabilities for their applications, enabling efficient data retrieval and management.",
  "longDesc": "Manticore Search is an open-source search engine designed to handle complex queries and large volumes of data with high performance. It is built on top of the Sphinx search engine, offering enhanced features and capabilities.\n\n**Key Features:**\n- **One-Click Deployment:** Easily deploy Manticore Search using Docker for a rapid setup and configuration process.\n- **Scalability:** Capable of handling millions of documents and high query loads, making it suitable for both small and large-scale applications.\n- **Privacy and Security:** Offers robust access controls and data encryption, ensuring the safety of user information.\n- **API Compatibility:** Provides a RESTful API for seamless integration with various applications, enabling custom search functionalities.\n- **Advanced Query Capabilities:** Supports complex querying and filtering, allowing users to perform detailed searches across their datasets.",
  "useCases": "- **Developers:** Integrate Manticore Search into applications to provide fast and reliable search functionalities for users.\n- **Enterprises:** Use Manticore Search for data management and retrieval across large databases, enhancing operational efficiency.\n- **Researchers:** Implement Manticore Search to analyze and search large datasets in academic or industry-specific research projects.",
  "support": "- **Community Forums:** Engage with the Manticore Search community for support and discussions through the [Manticore Community Forum](https://manticoresearch.com/community/).\n- **Documentation:** Comprehensive guides and user manuals are available at the [Manticore Search Documentation](https://manual.manticoresearch.com/Introduction) for detailed reference.\n- **Troubleshooting Help:** Access the [Manticore Search GitHub Repository](https://github.com/manticoresoftware/manticoresearch) to report bugs and find community-contributed solutions.\n\nThis template provides an overview of Manticore Search’s functionalities and practical applications, emphasizing its importance in implementing efficient search solutions. For more detailed information, visit the [official Manticore Search website](https://manticoresearch.com/).",
  "tags": ["Search Engines"],
  "website": "https://manticoresearch.com",
  "implemented": false,
  "logo": "https://manticoresearch.com/images/favicon_huef5b6b9b4667cfcb07efebc9f11841a5_5793_32x0_resize_box_3.png",
  "specs": {
    "ram": 0,
    "storage": 0
  },
  "nixName": "manticoresearch",
  "options": [
    {
      "name": "search/manticore.nix",
      "desc": "Whether to enable Manticoresearch.",
      "nixName": "relatedOption.manticore.enable",
      "type": "boolean",
      "value": "false"
    },
    {
      "name": "search/manticore.nix",
      "desc": "Configuration for Manticoresearch. See https://manual.manticoresearch.com/Server%20settingsfor more information.",
      "nixName": "relatedOption.manticore.settings",
      "type": "JSON value",
      "value": "{\n  searchd = {\n    data_dir = \"/var/lib/manticore\";\n    listen = [\n      \"127.0.0.1:9312\"\n      \"127.0.0.1:9306:mysql\"\n      \"127.0.0.1:9308:http\"\n    ];\n    log = \"/var/log/manticore/searchd.log\";\n    pid_file = \"/run/manticore/searchd.pid\";\n    query_log = \"/var/log/manticore/query.log\";\n  };\n}"
    }
  ]
}
