{
  "name": "manticore",
  "desc": "Deploy Manticore to utilize an open-source symbolic execution tool designed for security research and analysis. Manticore allows users to analyze binaries and smart contracts, facilitating the detection of vulnerabilities and security flaws.",
  "longDesc": "Manticore is a powerful symbolic execution tool that enables automated analysis of binary executables and smart contracts. It is used primarily in security research to uncover vulnerabilities, perform formal verification, and assist in reverse engineering tasks.\n\n**Key Features:**\n- **One-Click Deployment:** Easily deploy Manticore using Docker or other containerization methods for rapid setup.\n- **Scalability:** Designed to handle complex analyses efficiently, making it suitable for both individual researchers and large teams.\n- **Privacy and Security:** Operates locally, ensuring sensitive data remains confidential and secure during analysis.\n- **API Compatibility:** Offers a Python API for integration with other tools and workflows, enhancing usability and flexibility.\n- **Comprehensive Reporting:** Generates detailed reports on vulnerabilities and execution paths, aiding in security assessments.",
  "useCases": "- **Security Researchers:** Utilize Manticore to analyze software for vulnerabilities, helping to improve security protocols and practices.\n- **Developers:** Perform automated testing on smart contracts to ensure they are secure before deployment on blockchain platforms.\n- **Academic Institutions:** Incorporate Manticore in courses focused on cybersecurity, teaching students about binary analysis and security research.",
  "support": "- **Community Forums:** Engage with the Manticore community for support and discussions through the [Manticore GitHub Repository](https://github.com/trailofbits/manticore).\n- **Documentation:** Comprehensive guides and user manuals are available at the [Manticore Documentation](https://manticore.readthedocs.io/) for detailed reference.\n- **Troubleshooting Help:** Access the issues section on GitHub to report bugs and find community-contributed solutions.\n\nThis template provides an overview of Manticore’s functionalities and practical applications, emphasizing its role in security analysis. For more detailed information, visit the [official Manticore project page](https://github.com/trailofbits/manticore).",
  "nixName": "manticore",
  "specs": {
    "ram": 0,
    "storage": 0
  },
  "tags": [],
  "website": "http://manticore.cs.uchicago.edu/",
  "implemented": false,
  "logo": "",
  "options": [
    {
      "name": "enable",
      "desc": "Whether to enable Manticoresearch.",
      "nixName": "enable",
      "type": "boolean",
      "value": "true"
    },
    {
      "name": "settings",
      "desc": "Configuration for Manticoresearch. See https://manual.manticoresearch.com/Server%20settings for more information.",
      "nixName": "settings",
      "type": "JSON value",
      "value": "{\n  searchd = {\n    data_dir = \"/var/lib/manticore\";\n    listen = [\n      \"127.0.0.1:9312\"\n      \"127.0.0.1:9306:mysql\"\n      \"127.0.0.1:9308:http\"\n    ];\n    log = \"/var/log/manticore/searchd.log\";\n    pid_file = \"/run/manticore/searchd.pid\";\n    query_log = \"/var/log/manticore/query.log\";\n  };\n}"
    }
  ]
}
