{
  "name": "MeshCentral",
  "desc": "Deploy MeshCentral to create a robust, open-source remote management tool that allows users to manage devices and provide support remotely. MeshCentral offers a comprehensive platform for IT administrators to monitor, control, and support their devices effectively.",
  "longDesc": "MeshCentral is a web-based remote management software that enables users to control devices over the internet. It supports various platforms, allowing users to access and manage their devices seamlessly, regardless of location.\n\n**Key Features:**\n- **One-Click Deployment:** Easily deploy MeshCentral using Docker or package managers for quick setup and installation.\n- **Scalability:** Designed to handle numerous devices and users simultaneously, making it suitable for small businesses to large enterprises.\n- **Privacy and Security:** Provides encrypted communications and allows users to self-host, ensuring data remains private and secure.\n- **API Compatibility:** Features a RESTful API for integration with other systems, enabling automation and extended functionality.\n- **Cross-Platform Support:** Supports various operating systems, including Windows, Linux, and macOS, allowing for flexible device management.",
  "useCases": "- **IT Administrators:** Use MeshCentral to remotely manage and troubleshoot devices, reducing the need for physical access to systems.\n- **Support Teams:** Provide remote assistance to end-users, enabling faster resolution of technical issues.\n- **Educational Institutions:** Manage classroom devices and support students with their technology needs.",
  "support": "- **Community Forums:** Engage with the MeshCentral community for support and discussions through the [MeshCentral Forum](https://meshcentral.com/forum).\n- **Documentation:** Comprehensive guides and user manuals are available at the [MeshCentral Documentation](https://meshcentral.com/docs/) for detailed reference.\n- **Troubleshooting Help:** Access the [MeshCentral GitHub Repository](https://github.com/Ylianst/MeshCentral) to report bugs and find community-contributed solutions.\n\nThis template provides an overview of MeshCentral’s functionalities and practical applications, emphasizing its role in remote device management. For more detailed information, visit the [official MeshCentral website](https://meshcentral.com/docs/MeshCentral2UserGuide.pdf).",
  "nixName": "meshcentral",
  "specs": {
    "ram": 0,
    "storage": 0
  },
  "tags": ["Remote Access"],
  "website": "https://meshcentral.com/",
  "implemented": false,
  "logo": "",
  "options": [
    {
      "name": "enable",
      "desc": "Whether to enable MeshCentral computer management server.",
      "nixName": "enable",
      "type": "boolean",
      "value": "true"
    },
    {
      "name": "package",
      "desc": "The meshcentral package to use.",
      "nixName": "package",
      "type": "package",
      "value": "pkgs.meshcentral"
    },
    {
      "name": "settings",
      "desc": "Settings for MeshCentral. Refer to upstream documentation for details:  JSON Schema definition simple sample configuration complex sample configuration Old homepage with documentation link",
      "nixName": "settings",
      "type": "JSON value",
      "value": ""
    }
  ]
}
