{
  "name": "Metabase",
  "desc": "Deploy Metabase to create a powerful business intelligence tool that allows users to visualize data, generate insights, and make data-driven decisions effortlessly. Metabase provides an intuitive interface for querying databases without the need for extensive technical knowledge.",
  "longDesc": "Metabase is an open-source analytics platform that enables users to connect to various databases, create visualizations, and generate reports easily. It is designed for simplicity, allowing even non-technical users to explore and understand their data.\n\n**Key Features:**\n- **One-Click Deployment:** Quickly set up Metabase using Docker, simplifying the installation and configuration process.\n- **Scalability:** Supports a wide range of databases and large datasets, making it suitable for both small startups and large enterprises.\n- **Privacy and Security:** Ensures that sensitive data remains secure with role-based access controls and data encryption.\n- **API Compatibility:** Offers a RESTful API for integration with other applications, enabling automated reporting and data management.\n- **User-Friendly Interface:** Features an easy-to-use interface for creating dashboards, visualizations, and reports without requiring programming skills.",
  "useCases": "- **Data Analysts:** Utilize Metabase to explore datasets, generate reports, and share insights across teams.\n- **Businesses:** Implement Metabase to track key performance indicators (KPIs) and make informed business decisions based on real-time data.\n- **Educators:** Use Metabase for analyzing student performance data and visualizing educational metrics to enhance teaching strategies.",
  "support": "- **Community Forums:** Engage with the Metabase community for support and discussions through the [Metabase Community Forum](https://discuss.metabase.com/).\n- **Documentation:** Comprehensive guides and user manuals are available at the [Metabase Documentation](https://www.metabase.com/docs/latest/) for detailed reference.\n- **Troubleshooting Help:** Access the issues section on [Metabase GitHub Repository](https://github.com/metabase/metabase) to report bugs and find community-contributed solutions.\n\nThis template provides an overview of Metabase’s functionalities and practical applications, emphasizing its role in data visualization and business intelligence. For more detailed information, visit the [official Metabase website](https://www.metabase.com/).",
  "nixName": "metabase",
  "specs": {
    "ram": 1000,
    "storage": 10000
  },
  "tags": ["Analytics"],
  "website": "https://metabase.com",
  "implemented": false,
  "logo": "https://metabase.com/images/favicon.ico",
  "options": [
    {
      "name": "enable",
      "desc": "Whether to enable Metabase service.",
      "nixName": "enable",
      "type": "boolean",
      "value": "true"
    },
    {
      "name": "listen.ip",
      "desc": "IP address that Metabase should listen on.",
      "nixName": "listen.ip",
      "type": "string",
      "value": "0.0.0.0"
    },
    {
      "name": "listen.port",
      "desc": "Listen port for Metabase.",
      "nixName": "listen.port",
      "type": "16 bit unsigned integer; between 0 and 65535 (both inclusive)",
      "value": "3000"
    },
    {
      "name": "openFirewall",
      "desc": "Open ports in the firewall for Metabase.",
      "nixName": "openFirewall",
      "type": "boolean",
      "value": "false"
    },
    {
      "name": "ssl.enable",
      "desc": "Whether to enable SSL (https) support.",
      "nixName": "ssl.enable",
      "type": "boolean",
      "value": "false"
    },
    {
      "name": "ssl.keystore",
      "desc": "Java KeyStore file containing the certificates.",
      "nixName": "ssl.keystore",
      "type": "null or path",
      "value": "\"/var/lib/metabase/metabase.jks\""
    },
    {
      "name": "ssl.port",
      "desc": "Listen port over SSL (https) for Metabase.",
      "nixName": "ssl.port",
      "type": "16 bit unsigned integer; between 0 and 65535 (both inclusive)",
      "value": "8443"
    }
  ]
}
