{
    "name": "minecraft-server",
    "desc": "Minecraft Server",
    "nixName": "minecraft-server",
    "specs": {
        "ram": 1024,
        "storage": 1024
    },
    "tags": [
        "Server"
    ],
    "website": "https://minecraft.net",
    "logo": "",
    "options": [
        {
            "name": "dataDir",
            "desc": "Directory to store Minecraft database and other state/data files.",
            "nixName": "dataDir",
            "type": "path",
            "value": "\"/var/lib/minecraft\""
        },
        {
            "name": "declarative",
            "desc": "Whether to use a declarative Minecraft server configuration. Only if set to true, the options services.minecraft-server.whitelist and services.minecraft-server.serverProperties will be applied.",
            "nixName": "declarative",
            "type": "boolean",
            "value": "false"
        },
        {
            "name": "enable",
            "desc": "If enabled, start a Minecraft Server. The server data will be loaded from and saved to services.minecraft-server.dataDir.",
            "nixName": "enable",
            "type": "boolean",
            "value": "true"
        },
        {
            "name": "eula",
            "desc": "Whether you agree to  Mojangs EULA. This option must be set to true to run Minecraft server.",
            "nixName": "eula",
            "type": "boolean",
            "value": "false"
        },
        {
            "name": "jvmOpts",
            "desc": "JVM options for the Minecraft server.",
            "nixName": "jvmOpts",
            "type": "strings concatenated with \" \"",
            "value": "\"-Xmx2048M -Xms2048M\""
        },
        {
            "name": "openFirewall",
            "desc": "Whether to open ports in the firewall for the server.",
            "nixName": "openFirewall",
            "type": "boolean",
            "value": "true"
        },
        {
            "name": "package",
            "desc": "The minecraft-server package to use.",
            "nixName": "package",
            "type": "package",
            "value": "pkgs.minecraft-server"
        },
        {
            "name": "serverProperties",
            "desc": "Minecraft server properties for the server.properties file. Only has an effect when services.minecraft-server.declarative is set to true. See https://minecraft.gamepedia.com/Server.properties#Java_Edition_3 for documentation on these values.",
            "nixName": "serverProperties",
            "type": "attribute set of (boolean or signed integer or string)",
            "value": "{ }",
            "options": [
                {
                    "name": "allow-flight",
                    "nixName": "allow-flight",
                    "type": "boolean",
                    "value": "false",
                    "desc": "Allows users to use flight on the server while in Survival mode, if they have a [[mod]] that provides flight installed.With allow-flight enabled, [[griefers]] may become more common, because it makes their work easier. In Creative mode, this has no effect.:'''false''' - Flight is not allowed (players in air for at least 5 seconds get kicked).:'''true''' - Flight is allowed, and used if the player has a fly mod installed."
                },
                {
                    "name": "allow-nether",
                    "nixName": "allow-nether",
                    "type": "boolean",
                    "value": "true",
                    "desc": "Allows players to travel to the [[Nether]].:'''false''' - [[Nether]] portals do not work.:'''true''' - The server allows [[portal]]s to send players to the Nether."
                },
                {
                    "name": "broadcast-console-to-ops",
                    "nixName": "broadcast-console-to-ops",
                    "type": "boolean",
                    "value": "true",
                    "desc": "Send console command outputs to all [[Server#Managing_and_maintaining_a_server online operators]]."
                },
                {
                    "name": "broadcast-rcon-to-ops",
                    "nixName": "broadcast-rcon-to-ops",
                    "type": "boolean",
                    "value": "true",
                    "desc": "Send rcon console command outputs to all online operators."
                },
                {
                    "name": "difficulty",
                    "nixName": "difficulty",
                    "type": "string",
                    "value": "easy",
                    "desc": "Defines the [[difficulty]] (such as damage dealt by mobs and the way hunger and poison affects players) of the server.If a legacy difficulty number is specified, it is silently converted to a difficulty name.:'''peaceful''' (0):'''easy''' (1):'''normal''' (2):'''hard''' (3)"
                },
                {
                    "name": "enable-command-block",
                    "nixName": "enable-command-block",
                    "type": "boolean",
                    "value": "false",
                    "desc": "Enables command blocks"
                },
                {
                    "name": "enable-jmx-monitoring",
                    "nixName": "enable-jmx-monitoring",
                    "type": "boolean",
                    "value": "false",
                    "desc": "Exposes an MBean with the Object name <code>net.minecraft.server:type=Server</code> and two attributes <code>averageTickTime</code> and <code>tickTimes</code> exposing the tick times in milliseconds.In order for enabling JMX on the Java runtime you also need to add a couple of JVM flags to the startup as documented [https://docs.oracle.com/javase/8/docs/technotes/guides/management/agent.html here]."
                },
                {
                    "name": "enable-rcon",
                    "nixName": "enable-rcon",
                    "type": "boolean",
                    "value": "false",
                    "desc": "Enables remote access to the server console.* It's not recommended to expose RCON to the Internet, because RCON protocol transfers everything without encryption. Everything (including RCON password) communicated between the RCON server and client can be leaked to someone listening in on your connection."
                },
                {
                    "name": "enable-status",
                    "nixName": "enable-status",
                    "type": "boolean",
                    "value": "true",
                    "desc": "Makes the server appear as \"online\" on the server list.If set to false, it will suppress replies from clients. This means it will appear as offline, but will still accept connections."
                },
                {
                    "name": "enable-query",
                    "nixName": "enable-query",
                    "type": "boolean",
                    "value": "false",
                    "desc": "Enables GameSpy4 protocol server listener. Used to get information about server."
                },
                {
                    "name": "enforce-secure-profile",
                    "nixName": "enforce-secure-profile",
                    "type": "boolean",
                    "value": "true",
                    "desc": "If set to '''true''', players without a Mojang-signed public key will not be able to connect to the server."
                },
                {
                    "name": "enforce-whitelist",
                    "nixName": "enforce-whitelist",
                    "type": "boolean",
                    "value": "false",
                    "desc": "Enforces the whitelist on the server.When this option is enabled, users who are not present on the whitelist (if it's enabled) get kicked from the server after the server reloads the whitelist file.:'''false''' - No user gets kicked if not on the whitelist.:'''true''' - Online users not on the whitelist get kicked."
                },
                {
                    "name": "entity-broadcast-range-percentage",
                    "nixName": "entity-broadcast-range-percentage",
                    "type": "integer (10-1000)",
                    "value": "100",
                    "desc": "Controls how close entities need to be before being sent to clients. Higher values means they'll be rendered from farther away, potentially causing more lag. This is expressed the percentage of the default value. For example, setting to 50 will make it half as usual. This mimics the function on the client video settings (not unlike Render Distance, which the client can customize so long as it's under the server's setting)."
                },
                {
                    "name": "force-gamemode",
                    "nixName": "force-gamemode",
                    "type": "boolean",
                    "value": "false",
                    "desc": "Force players to join in the default [[game mode]].:'''false''' - Players join in the gamemode they left in.:'''true''' - Players always join in the default gamemode."
                },
                {
                    "name": "function-permission-level",
                    "nixName": "function-permission-level",
                    "type": "integer (1-4)",
                    "value": "2",
                    "desc": "Sets the default permission level for [[Function (Java Edition) functions]].See [[permission level]] for the details on the 4 levels."
                },
                {
                    "name": "gamemode",
                    "nixName": "gamemode",
                    "type": "string",
                    "value": "survival",
                    "desc": "Defines the [[game mode mode of gameplay]].If a legacy gamemode number is specified, it is silently converted to a gamemode name.:'''[[survival]]''' (0):'''[[creative]]''' (1):'''[[adventure]]''' (2):'''[[spectator]]''' (3)"
                },
                {
                    "name": "generate-structures",
                    "nixName": "generate-structures",
                    "type": "boolean",
                    "value": "true",
                    "desc": "Defines whether [[structures]] (such as villages) can be generated.:'''false''' - Structures are not generated in new chunks.:'''true''' - Structures are generated in new chunks.'''Note:''' ''Dungeons still generate if this is set to false.''"
                },
                {
                    "name": "hardcore",
                    "nixName": "hardcore",
                    "type": "boolean",
                    "value": "false",
                    "desc": "If set to '''true''', server difficulty is ignored and set to hard and players are set to spectator mode if they die."
                },
                {
                    "name": "hide-online-players",
                    "nixName": "hide-online-players",
                    "type": "boolean",
                    "value": "false",
                    "desc": "If set to '''true''', a player list is not sent on status requests."
                },
                {
                    "name": "initial-disabled-packs",
                    "nixName": "initial-disabled-packs",
                    "type": "string",
                    "value": "",
                    "desc": "Comma-separated list of datapacks to not be auto-enabled on world creation."
                },
                {
                    "name": "initial-enabled-packs",
                    "nixName": "initial-enabled-packs",
                    "type": "string",
                    "value": "vanilla",
                    "desc": "Comma-separated list of datapacks to be enabled during world creation. Feature packs need to be explicitly enabled."
                },
                {
                    "name": "level-name",
                    "nixName": "level-name",
                    "type": "string",
                    "value": "world",
                    "desc": "The \"level-name\" value is used as the world name and its folder name. The player may also copy their saved game folder here, and change the name to the same as that folder's to load it instead.:Characters such as ' (apostrophe) may need to be escaped by adding a backslash before them."
                },
                {
                    "name": "level-seed",
                    "nixName": "level-seed",
                    "type": "string",
                    "value": "",
                    "desc": "Sets a world [[Seed (level generation) seed]] for the player's world, as in Singleplayer. The world generates with a random seed if left blank.:Some examples are: minecraft, 404, 1a2b3c."
                },
                {
                    "name": "level-type",
                    "nixName": "level-type",
                    "type": "string",
                    "value": "minecraft:normal",
                    "desc": "Determines the world preset that is generated.Escaping \":\" is required when using a world preset ID, and the vanilla world preset ID's namespace ({{cd minecraft:}}) can be omitted.:'''minecraft:normal''' - Standard world with hills, valleys, water, etc.:'''minecraft:[[Superflat flat]]''' - A flat world with no features, can be modified with '''generator-settings'''.:'''minecraft:[[Large Biomes large_biomes]]''' - Same as default but all biomes are larger.:'''minecraft:[[amplified]]''' - Same as default but world-generation height limit is increased.:'''minecraft:[[Single Biome single_biome_surface]]''' - A buffet world which the entire overworld consists of one biome, can be modified with '''generator-settings'''.:'''[[buffet]]''' - Only for 1.15 or before. Same as default unless '''generator-settings''' is set.:'''default_1_1''' - Only for 1.15 or before. Same as default, but counted as a different world type.:'''[[Old Customized customized]]''' - Only for 1.15 or before. After 1.13, this value is no different than default, but in 1.12 and before, it could be used to create a completely custom world."
                },
                {
                    "name": "max-chained-neighbor-updates",
                    "nixName": "max-chained-neighbor-updates",
                    "type": "integer{{more info the valid range}}",
                    "value": "1000000",
                    "desc": "Limiting the amount of consecutive neighbor updates before skipping additional ones. Negative values remove the limit."
                },
                {
                    "name": "max-players",
                    "nixName": "max-players",
                    "type": "integer (0-(2^31 - 1))",
                    "value": "20",
                    "desc": "The maximum number of players that can play on the server at the same time. Note that more players on the server consume more resources. Note also, op player connections are not supposed to count against the max players, but ops currently cannot join a full server. However, this can be changed by going to the file called ops.json in the player's server directory, opening it, finding the op that the player wants to change, and changing the setting called bypassesPlayerLimit to true (the default is false). This means that that op does not have to wait for a player to leave in order to join. Extremely large values for this field result in the client-side user list being broken."
                },
                {
                    "name": "max-tick-time",
                    "nixName": "max-tick-time",
                    "type": "integer (-1 or 0–(2^63 - 1))",
                    "value": "60000",
                    "desc": "The maximum number of milliseconds a single tick may take before the server watchdog stops the server with the message, ''A single server tick took 60.00 seconds (should be max 0.05); Considering it to be crashed, server will forcibly shutdown.'' Once this criterion is met, it calls System.exit(1).:'''-1''' - disable watchdog entirely (this disable option was added in 14w32a)"
                },
                {
                    "name": "max-world-size",
                    "nixName": "max-world-size",
                    "type": "integer (1-29999984)",
                    "value": "29999984",
                    "desc": "This sets the maximum possible size in blocks, expressed as a radius, that the [[world border]] can obtain. Setting the world border bigger causes the commands to complete successfully but the actual border does not move past this block limit. Setting the max-world-size higher than the default doesn't appear to do anything. Examples: *Setting max-world-size to 1000 allows the player to have a 2000×2000 world border.*Setting max-world-size to 4000 gives the player an 8000×8000 world border."
                },
                {
                    "name": "motd",
                    "nixName": "motd",
                    "type": "string",
                    "value": "Minecraft Server running on §dXnode",
                    "desc": "This is the message that is displayed in the server list of the client, below the name.* The MOTD supports [[Formatting codes#Use in server.properties and pack.mcmeta color and formatting codes]].* If the MOTD is over 59 characters, the server list may report a communication error."
                },
                {
                    "name": "network-compression-threshold",
                    "nixName": "network-compression-threshold",
                    "type": "integer",
                    "value": "256",
                    "desc": "By default it allows packets that are ''n-1'' bytes big to go normally, but a packet of ''n'' bytes or more gets compressed down. So, a lower number means more compression but compressing small amounts of bytes might actually end up with a larger result than what went in.:'''-1''' - disable compression entirely:'''0''' - compress everything'''Note:''' ''The Ethernet spec requires that packets less than 64 bytes become padded to 64 bytes. Thus, setting a value lower than 64 may not be beneficial. It is also not recommended to exceed the MTU, typically 1500 bytes.''"
                },
                {
                    "name": "online-mode",
                    "nixName": "online-mode",
                    "type": "boolean",
                    "value": "true",
                    "desc": "Server checks connecting players against ''Minecraft'' account database. Set this to false only if the player's server is '''not''' connected to the Internet. Hackers with fake accounts can connect if this is set to false! If minecraft.net is down or inaccessible, no players can connect if this is set to true. Setting this variable to off purposely is called \"cracking\" a server, and servers that are present with online mode off are called \"cracked\" servers, allowing players with unlicensed copies of ''[[Minecraft]]'' to join.:'''true''' - Enabled. The server assumes it has an Internet connection and checks every connecting player.:'''false''' - Disabled. The server does not attempt to check connecting players."
                },
                {
                    "name": "op-permission-level",
                    "nixName": "op-permission-level",
                    "type": "integer (0-4)",
                    "value": "4",
                    "desc": "Sets the default [[permission level]] for ops when using {{cmd op}}."
                },
                {
                    "name": "player-idle-timeout",
                    "nixName": "player-idle-timeout",
                    "type": "integer",
                    "value": "0",
                    "desc": "If non-zero, players are kicked from the server if they are idle for more than that many minutes. :'''Note:''' ''Idle time is reset when the server receives one of the following packets:'':*[http://wiki.vg/Protocol#Click_Window Click Window]:*[http://wiki.vg/Protocol#Enchant_Item Enchant Item]:*[http://wiki.vg/Protocol#Update_Sign Update Sign]:*[http://wiki.vg/Protocol#Player_Digging Player Digging]:*[http://wiki.vg/Protocol#Player_Block_Placement Player Block Placement]:*[http://wiki.vg/Protocol#Held_Item_Change_.28serverbound.29 Held Item Change]:*[http://wiki.vg/Protocol#Animation_.28serverbound.29 Animation] (swing arm):*[http://wiki.vg/Protocol#Entity_Action Entity Action]:*[http://wiki.vg/Protocol#Client_Status Client Status]:*[http://wiki.vg/Protocol#Chat_Message_.28serverbound.29 Chat Message]:*[http://wiki.vg/Protocol#Use_Entity Use Entity]"
                },
                {
                    "name": "prevent-proxy-connections",
                    "nixName": "prevent-proxy-connections",
                    "type": "boolean",
                    "value": "false",
                    "desc": "If the ISP/AS sent from the server is different from the one from Mojang Studios' authentication server, the player is kicked."
                },
                {
                    "name": "previews-chat",
                    "nixName": "previews-chat",
                    "type": "boolean",
                    "value": "false",
                    "desc": "If set to '''true''', chat preview will be enabled.:'''true''' - Enabled. When enabled, a server-controlled preview appears above the chat edit box, showing how the message will look when sent.:'''false''' - Disabled."
                },
                {
                    "name": "pvp",
                    "nixName": "pvp",
                    "type": "boolean",
                    "value": "true",
                    "desc": "Enable PvP on the server. Players shooting themselves with arrows receive damage only if PvP is enabled.:'''true''' - Players can kill each other.:'''false''' - Players cannot kill other players (also known as '''Player versus Environment''' ('''PvE''')).'''Note:''' ''Indirect damage sources spawned by players (such as [[lava]], [[fire]], [[TNT]] and to some extent [[water]], [[sand]] and [[gravel]]) still deal damage to other players.''"
                },
                {
                    "name": "query.port",
                    "nixName": "\"query.port\"",
                    "type": "integer (1-(2^16 - 2))",
                    "value": "25565",
                    "desc": "Sets the port for the query server (see '''enable-query''')."
                },
                {
                    "name": "rate-limit",
                    "nixName": "rate-limit",
                    "type": "integer",
                    "value": "0",
                    "desc": "Sets the maximum amount of packets a user can send before getting kicked. Setting to 0 disables this feature."
                },
                {
                    "name": "rcon.password",
                    "nixName": "\"rcon.password\"",
                    "type": "string",
                    "value": "",
                    "desc": "Sets the password for RCON: a remote console protocol that can allow other applications to connect and interact with a ''Minecraft'' server over the internet."
                },
                {
                    "name": "rcon.port",
                    "nixName": "\"rcon.port\"",
                    "type": "integer (1-(2^16 - 2))",
                    "value": "25575",
                    "desc": "Sets the RCON network port."
                },
                {
                    "name": "resource-pack",
                    "nixName": "resource-pack",
                    "type": "string",
                    "value": "",
                    "desc": "Optional URI to a [[resource pack]]. The player may choose to use it. Note that (in some versions before 1.15.2), the \":\" and \"=\" characters need to be escaped with a backslash (\\), e.g. http\\://somedomain.com/somepack.zip?someparam\\=somevalueThe resource pack may not have a larger file size than 250 MiB (Before 1.18: 100 MiB (≈ 100.8 MB)) (Before 1.15: 50 MiB (≈ 50.4 MB)). Note that download success or failure is logged by the client, and not by the server."
                },
                {
                    "name": "resource-pack-prompt",
                    "nixName": "resource-pack-prompt",
                    "type": "string",
                    "value": "",
                    "desc": "{{Anchor resource-pack-prompt}}Optional, adds a custom message to be shown on resource pack prompt when <code>require-resource-pack</code> is used.Expects chat component syntax, can contain multiple lines."
                },
                {
                    "name": "resource-pack-sha1",
                    "nixName": "resource-pack-sha1",
                    "type": "string",
                    "value": "",
                    "desc": "{{Anchor resource-pack-hash}} Optional SHA-1 digest of the resource pack, in lowercase hexadecimal. It is recommended to specify this, because it is used to verify the integrity of the resource pack.'''Note:''' If the resource pack is any different, a yellow message \"Invalid sha1 for resource-pack-sha1\" appears in the console when the server starts. Due to the nature of hash functions, errors have a tiny probability of occurring, so this consequence has no effect."
                },
                {
                    "name": "require-resource-pack",
                    "nixName": "require-resource-pack",
                    "type": "boolean",
                    "value": "false",
                    "desc": "{{Anchor resource-pack-hash}}When this option is enabled (set to true), players will be prompted for a response and will be disconnected if they decline the required pack."
                },
                {
                    "name": "server-ip",
                    "nixName": "server-ip",
                    "type": "string",
                    "value": "",
                    "desc": "The player should set this if they want the server to bind to a particular IP. It is strongly recommended that the player leaves server-ip blank.:Set to blank, or the IP the player want their server to run (listen) on."
                },
                {
                    "name": "server-port",
                    "nixName": "server-port",
                    "type": "integer (1-(2^16 - 2))",
                    "value": "25565",
                    "desc": "Changes the port the server is hosting (listening) on. This port must be [[wikipedia:Port forwarding forwarded]] if the server is hosted in a network using [[wikipedia:Network address translation NAT]] (if the player has a home router/firewall)."
                },
                {
                    "name": "simulation-distance",
                    "nixName": "simulation-distance",
                    "type": "integer (3-32)",
                    "value": "10",
                    "desc": "Sets the maximum distance from players that living entities may be located in order to be updated by the server, measured in chunks in each direction of the player (radius, not diameter). If entities are outside of this radius, then they will not be ticked by the server nor will they be visible to players.''10 is the default/recommended. If the player has major lag, this value is recommended to be reduced.''"
                },
                {
                    "name": "snooper-enabled",
                    "nixName": "snooper-enabled",
                    "type": "boolean",
                    "value": "true",
                    "desc": "Sets whether the server sends snoop data regularly to http://snoop.minecraft.net.:'''false''' - disable snooping.:'''true''' - enable snooping."
                },
                {
                    "name": "spawn-animals",
                    "nixName": "spawn-animals",
                    "type": "boolean",
                    "value": "true",
                    "desc": "Determines if [[animal]]s can spawn.:'''true''' - Animals spawn as normal.:'''false''' - Animals immediately vanish.''If the player has major lag, it is recommended to turn this off/set to false.''"
                },
                {
                    "name": "spawn-monsters",
                    "nixName": "spawn-monsters",
                    "type": "boolean",
                    "value": "true",
                    "desc": "Determines if monsters can spawn.:'''true''' - Enabled. Monsters appear at night and in the dark.:'''false''' - Disabled. No monsters.This setting has no effect if difficulty = 0 (peaceful). If difficulty is not = 0, a monster can still spawn from a [[monster spawner]].''If the player has major lag, it is recommended to turn this off/set to false.''"
                },
                {
                    "name": "spawn-npcs",
                    "nixName": "spawn-npcs",
                    "type": "boolean",
                    "value": "true",
                    "desc": "Determines whether villagers can spawn.:'''true''' - Enabled. Villagers spawn.:'''false''' - Disabled. No villagers."
                },
                {
                    "name": "spawn-protection",
                    "nixName": "spawn-protection",
                    "type": "integer",
                    "value": "16",
                    "desc": "Determines the side length of the square [[spawn protection]] area as 2''x''+1. Setting this to 0 disables the spawn protection. A value of 1 protects a 3×3 square centered on the spawn point. 2 protects 5×5, 3 protects 7×7, etc. This option is not generated on the first server start and appears when the first player joins. If there are no [[Server#Managing_and_maintaining_a_server ops]] set on the server, the spawn protection is disabled automatically as well."
                },
                {
                    "name": "sync-chunk-writes",
                    "nixName": "sync-chunk-writes",
                    "type": "boolean",
                    "value": "true",
                    "desc": "Enables synchronous chunk writes."
                },
                {
                    "name": "use-native-transport",
                    "nixName": "use-native-transport",
                    "type": "boolean",
                    "value": "true",
                    "desc": "Linux server performance improvements: optimized packet sending/receiving on Linux:'''true''' - Enabled. Enable Linux packet sending/receiving optimization:'''false''' - Disabled. Disable Linux packet sending/receiving optimization"
                },
                {
                    "name": "view-distance",
                    "nixName": "view-distance",
                    "type": "integer (3-32)",
                    "value": "10",
                    "desc": "Sets the amount of world data the server sends the client, measured in chunks in each direction of the player (radius, not diameter). It determines the server-side viewing distance.''10 is the default/recommended. If the player has major lag, this value is recommended to be reduced.''"
                }
            ]
        },
        {
            "name": "whitelist",
            "desc": "Whitelisted players, only has an effect when services.minecraft-server.declarative is true and the whitelist is enabled via services.minecraft-server.serverProperties by setting white-list to true. This is a mapping from Minecraft usernames to UUIDs. You can use https://mcuuid.net/ to get a Minecraft UUID for a username.",
            "nixName": "whitelist",
            "type": "attribute set of Minecraft UUID",
            "value": "{ }"
        }
    ]
}