{
  "name": "Pleroma",
  "desc": "Deploy Pleroma to create a lightweight, decentralized social networking platform that allows users to communicate and share content freely. Pleroma is designed to be self-hosted, giving users control over their data and the community they build.",
  "longDesc": "Pleroma is an open-source social media server based on the ActivityPub protocol, allowing users to interact in a federated environment. It supports a variety of features typical in social networks, such as posts, direct messages, and notifications.\n\n**Key Features:**\n- **One-Click Deployment:** Easily set up Pleroma using Docker or similar container technologies for quick installation and management.\n- **Scalability:** Designed to handle a large number of users and interactions efficiently, making it suitable for both small communities and larger instances.\n- **Privacy and Security:** Focuses on user privacy, allowing individuals to control their data and the visibility of their content.\n- **API Compatibility:** Integrates seamlessly with other platforms through the ActivityPub protocol, enabling interaction with different social networks.\n- **Customizable:** Offers extensive customization options, allowing users to modify the appearance and functionality of their instance.",
  "useCases": "- **Developers:** Create and manage their own social networking applications using Pleroma’s open-source codebase.\n- **Community Managers:** Foster online communities with customized features and privacy controls tailored to their members' needs.\n- **Educators:** Use Pleroma as a platform for collaborative learning and discussions in educational settings.",
  "support": "- **Community Forums:** Engage with the Pleroma community for support and discussions through the [Pleroma GitHub Repository](https://github.com/pleroma/pleroma).\n- **Documentation:** Comprehensive guides and user manuals are available at the [Pleroma Documentation](https://docs.pleroma.social/) for detailed reference.\n- **Troubleshooting Help:** Access the issues section on GitHub to report bugs and find community-contributed solutions.\n\nThis template provides an overview of Pleroma’s functionalities and practical applications, emphasizing its role in creating decentralized social networks. For more detailed information, visit the [official Pleroma documentation](https://docs.pleroma.social/).",
  "nixName": "pleroma",
  "specs": {
    "ram": 2048,
    "storage": 0
  },
  "tags": ["Communication - Social Networks and Forums"],
  "website": "https://git.pleroma.social/pleroma/pleroma",
  "implemented": false,
  "logo": "https://git.pleroma.social/uploads/-/system/appearance/favicon/1/favicon.png",
  "options": [
    {
      "name": "configs",
      "desc": "Pleroma public configuration. This list gets appended from left to right into /etc/pleroma/config.exs. Elixir evaluates its configuration imperatively, meaning you can override a setting by appending a new str to this NixOS option list. DO NOT STORE ANY PLEROMA SECRET HERE, use services.pleroma.secretConfigFile instead. This setting is going to be stored in a file part of the Nix store. The Nix store being world-readable, it’s not the right place to store any secret Have a look to Pleroma section in the NixOS manual for more information.",
      "nixName": "configs",
      "type": "list of string",
      "value": ""
    },
    {
      "name": "enable",
      "desc": "Whether to enable pleroma.",
      "nixName": "enable",
      "type": "boolean",
      "value": "true"
    },
    {
      "name": "group",
      "desc": "Group account under which pleroma runs.",
      "nixName": "group",
      "type": "string",
      "value": "pleroma"
    },
    {
      "name": "package",
      "desc": "The pleroma package to use.",
      "nixName": "package",
      "type": "package",
      "value": "pkgs.pleroma"
    },
    {
      "name": "secretConfigFile",
      "desc": "Path to the file containing your secret pleroma configuration. DO NOT POINT THIS OPTION TO THE NIX STORE, the store being world-readable, it’ll compromise all your secrets.",
      "nixName": "secretConfigFile",
      "type": "string",
      "value": "/var/lib/pleroma/secrets.exs"
    },
    {
      "name": "stateDir",
      "desc": "Directory where the pleroma service will save the uploads and static files.",
      "nixName": "stateDir",
      "type": "string",
      "value": "/var/lib/pleroma"
    },
    {
      "name": "user",
      "desc": "User account under which pleroma runs.",
      "nixName": "user",
      "type": "string",
      "value": "pleroma"
    }
  ]
}
