{
  "name": "python3.11-pyloadapi",
  "desc": "Deploy python3.11-pyloadapi to enable interaction with the PyLoad download manager through a Python-based API. This setup allows users to automate and manage their downloads easily and effectively.",
  "longDesc": "The python3.11-pyloadapi is a Python client library designed to interact with the PyLoad download manager's API. It provides developers with tools to programmatically control download tasks, manage files, and integrate with various applications.\n\n**Key Features:**\n- **One-Click Deployment:** Set up the library using Docker or Python package managers for quick installation and easy access to PyLoad functionalities.\n- **Scalability:** Supports automation for individual users or larger setups, making it suitable for both personal and commercial use.\n- **Privacy and Security:** Operates locally, allowing users to keep their data secure while managing downloads through the API.\n- **API Compatibility:** Full compatibility with the PyLoad API, enabling comprehensive management of download tasks and file handling.\n- **Ease of Use:** Simplifies interaction with the PyLoad API, allowing developers to implement custom solutions without extensive API knowledge.",
  "useCases": "- **Home Users:** Automate the management of downloads, making it easier to schedule and control file retrieval.\n- **Developers:** Integrate the PyLoad API into applications to provide users with enhanced download management features.\n- **Businesses:** Use python3.11-pyloadapi to streamline download processes for large files or media content in an organizational setting.",
  "support": "- **Community Forums:** Engage with the PyLoad community for support and discussions through the [PyLoad GitHub Repository](https://github.com/tr4nt0r/PyLoadAPI).\n- **Documentation:** Comprehensive guides and user manuals are available at the [PyLoad API Documentation](https://docs.python.org/3/whatsnew/3.11.html) for detailed reference on setup and usage.\n- **Troubleshooting Help:** Access the issues section on GitHub to report bugs and find community-contributed solutions.\n\nThis template provides an overview of python3.11-pyloadapi’s functionalities and practical applications, emphasizing its role in automating and managing download tasks. For more detailed information, visit the [official PyLoadAPI GitHub page](https://github.com/tr4nt0r/PyLoadAPI).",
  "nixName": "pyload",
  "specs": {
    "ram": 0,
    "storage": 0
  },
  "tags": [],
  "website": "https://github.com/tr4nt0r/pyloadapi",
  "implemented": false,
  "logo": "",
  "options": [
    {
      "name": "credentialsFile",
      "desc": "File containing PYLOAD_DEFAULT_USERNAME and PYLOAD_DEFAULT_PASSWORD in the format of an EnvironmentFile=, as described by systemd.exec(5). If not given, they default to the username/password combo of pyload/pyload.",
      "nixName": "credentialsFile",
      "type": "null or path",
      "value": "null"
    },
    {
      "name": "downloadDirectory",
      "desc": "Directory to store downloads.",
      "nixName": "downloadDirectory",
      "type": "path",
      "value": "\"/var/lib/pyload/downloads\""
    },
    {
      "name": "enable",
      "desc": "Whether to enable pyLoad download manager.",
      "nixName": "enable",
      "type": "boolean",
      "value": "true"
    },
    {
      "name": "group",
      "desc": "Group under which pyLoad runs, and which owns the download directory.",
      "nixName": "group",
      "type": "string",
      "value": "pyload"
    },
    {
      "name": "listenAddress",
      "desc": "Address to listen on for the web UI.",
      "nixName": "listenAddress",
      "type": "string",
      "value": "localhost"
    },
    {
      "name": "package",
      "desc": "The pyLoad package to use.",
      "nixName": "package",
      "type": "package",
      "value": "pkgs.pyload-ng"
    },
    {
      "name": "port",
      "desc": "Port to listen on for the web UI.",
      "nixName": "port",
      "type": "16 bit unsigned integer; between 0 and 65535 (both inclusive)",
      "value": "8000"
    },
    {
      "name": "user",
      "desc": "User under which pyLoad runs, and which owns the download directory.",
      "nixName": "user",
      "type": "string",
      "value": "pyload"
    }
  ]
}
