{
  "name": "radicale",
  "desc": "Deploy Radicale to create a secure and flexible calendar and contact management server. Radicale allows users to host their own personal or collaborative calendar and contacts service using the CalDAV and CardDAV protocols.",
  "longDesc": "Radicale is an open-source server that provides a simple and efficient implementation of CalDAV and CardDAV for managing calendars and contacts. It allows users to synchronize their calendars and contacts with various clients in a decentralized manner, ensuring data privacy and control.\n\n**Key Features:**\n- **One-Click Deployment:** Easily set up Radicale using Docker or similar container technologies for quick and efficient installation.\n- **Scalability:** Supports multiple users and large datasets, making it suitable for both personal and enterprise environments.\n- **Privacy and Security:** Stores data locally, allowing users to maintain control over their information without relying on third-party services.\n- **API Compatibility:** Offers RESTful API endpoints, allowing integration with other applications and services.\n- **User-Friendly Interface:** Provides a straightforward configuration and management interface, simplifying the setup process.",
  "useCases": "- **Individuals:** Use Radicale to manage personal calendars and contacts securely without external dependencies.\n- **Teams:** Facilitate collaboration by sharing calendars and contacts among team members in a controlled environment.\n- **Developers:** Integrate Radicale with other applications, leveraging its API to enhance functionality in custom projects.",
  "support": "- **Community Forums:** Engage with the Radicale community for support and discussions through the [Radicale GitHub Repository](https://github.com/Kozea/Radicale).\n- **Documentation:** Comprehensive guides and user manuals are available at the [Radicale Documentation](https://radicale.org/) for detailed reference.\n- **Troubleshooting Help:** Access the Issues section on GitHub for community-contributed solutions and to report any bugs or feature requests.\n\nThis template provides an overview of Radicale’s functionalities and practical applications, emphasizing its role in managing calendars and contacts securely. For more detailed information, visit the [official Radicale website](https://radicale.org/).",
  "nixName": "radicale",
  "specs": {
    "ram": 0,
    "storage": 0
  },
  "tags": [],
  "website": "https://radicale.org/v3.html",
  "implemented": false,
  "logo": "",
  "options": [
    {
      "name": "config",
      "desc": "Radicale configuration, this will set the service configuration file. This option is mutually exclusive with settings. This option is deprecated. Use settings instead.",
      "nixName": "config",
      "type": "string",
      "value": ""
    },
    {
      "name": "enable",
      "desc": "Whether to enable Radicale CalDAV and CardDAV server.",
      "nixName": "enable",
      "type": "boolean",
      "value": "true"
    },
    {
      "name": "extraArgs",
      "desc": "Extra arguments passed to the Radicale daemon.",
      "nixName": "extraArgs",
      "type": "list of string",
      "value": "[ ]"
    },
    {
      "name": "package",
      "desc": "Radicale package to use.",
      "nixName": "package",
      "type": "package",
      "value": "pkgs.radicale"
    },
    {
      "name": "rights",
      "desc": "Configuration for Radicale’s rights file. See https://radicale.org/3.0.html#documentation/authentication-and-rights. This option only works in conjunction with settings. Setting this will also set settings.rights.type and settings.rights.file to appropriate values.",
      "nixName": "rights",
      "type": "attribute set of section of an INI file (attrs of INI atom (null, bool, int, float or string) or a non-empty list of them)",
      "value": "{ }"
    },
    {
      "name": "settings",
      "desc": "Configuration for Radicale. See https://radicale.org/3.0.html#documentation/configuration. This option is mutually exclusive with config.",
      "nixName": "settings",
      "type": "attribute set of section of an INI file (attrs of INI atom (null, bool, int, float or string) or a non-empty list of them)",
      "value": "{ }"
    }
  ]
}
