{
  "name": "RustDesk",
  "desc": "Deploy RustDesk to create a secure and user-friendly remote desktop solution. RustDesk enables users to access and control computers remotely, making it ideal for technical support, collaborative work, and remote access.",
  "longDesc": "RustDesk is an open-source remote desktop software that allows users to connect to and control remote computers over the internet. Built with Rust, it emphasizes performance and security, providing a reliable alternative to existing remote desktop solutions.\n\n**Key Features:**\n- **One-Click Deployment:** Simplifies setup using Docker or similar container technologies for easy installation and management.\n- **Scalability:** Designed to support a large number of concurrent connections, suitable for personal use or enterprise environments.\n- **Privacy and Security:** Offers end-to-end encryption for remote sessions, ensuring data safety and user privacy.\n- **Self-Hosted Option:** Users can deploy their own server for complete control over their data and connections.\n- **Cross-Platform Support:** Compatible with Windows, macOS, and Linux, allowing access from various devices.",
  "useCases": "- **IT Support:** Provide remote assistance and troubleshooting for users or clients without needing physical access to their devices.\n- **Collaborative Work:** Facilitate teamwork by allowing multiple users to access and work on shared projects remotely.\n- **Personal Use:** Enable users to access their home computers from anywhere, ensuring they can retrieve files or run applications remotely.",
  "support": "- **Community Forums:** Engage with other RustDesk users and developers through the [RustDesk GitHub Repository](https://github.com/rustdesk/rustdesk) for discussions and support.\n- **Documentation:** Comprehensive guides and user manuals are available at the [RustDesk Documentation](https://rustdesk.com/docs/) for detailed user reference.\n- **Troubleshooting Help:** Access the issues section on GitHub to report bugs and find community-contributed solutions.\n\nThis template provides an overview of RustDesk’s functionalities and practical applications, emphasizing its importance in remote access and support. For more detailed information, visit the [official RustDesk website](https://rustdesk.com/).",
  "tags": ["Remote Access"],
  "website": "https://rustdesk.com",
  "implemented": false,
  "logo": "",
  "specs": {
    "ram": 0,
    "storage": 0
  },
  "nixName": "rustdesk",
  "options": [
    {
      "name": "monitoring/rustdesk-server.nix",
      "desc": "The rustdesk-server package to use.",
      "nixName": "relatedOption.rustdesk-server.package",
      "type": "package",
      "value": "pkgs.rustdesk-server"
    },
    {
      "name": "monitoring/rustdesk-server.nix",
      "desc": "The public facing IP of the RustDesk relay.",
      "nixName": "relatedOption.rustdesk-server.relayIP",
      "type": "string",
      "value": null
    },
    {
      "name": "monitoring/rustdesk-server.nix",
      "desc": "Whether to enable RustDesk, a remote access and remote controlsoftware, allowing maintenance of computers and other devices..",
      "nixName": "relatedOption.rustdesk-server.enable",
      "type": "boolean",
      "value": "false"
    },
    {
      "name": "monitoring/rustdesk-server.nix",
      "desc": "Open the connection ports. TCP (21115, 21116, 21117, 21118, 21119)UDP (21116)",
      "nixName": "relatedOption.rustdesk-server.openFirewall",
      "type": "boolean",
      "value": "false"
    },
    {
      "name": "monitoring/rustdesk-server.nix",
      "desc": "A list of extra command line arguments to pass to thehbbs process.",
      "nixName": "relatedOption.rustdesk-server.extraSignalArgs",
      "type": "list of string",
      "value": "[ ]"
    },
    {
      "name": "monitoring/rustdesk-server.nix",
      "desc": "A list of extra command line arguments to pass to thehbbr process.",
      "nixName": "relatedOption.rustdesk-server.extraRelayArgs",
      "type": "list of string",
      "value": "[ ]"
    }
  ]
}
