{
  "name": "samba",
  "desc": "Deploy Samba to create an open-source software suite that provides seamless file and print services for SMB/CIFS clients, allowing interoperability between Linux/Unix servers and Windows clients.",
  "longDesc": "Samba is an implementation of the SMB/CIFS networking protocol that allows for file and print sharing between computers on a network. It enables Linux and Unix systems to communicate with Windows systems, allowing for cross-platform file sharing and printer access.\n\n**Key Features:**\n- **One-Click Deployment:** Easily deploy Samba using package managers or Docker for quick and straightforward installation.\n- **Scalability:** Suitable for small networks as well as large enterprise environments, capable of managing numerous users and resources.\n- **Privacy and Security:** Supports various authentication methods and encryption options to secure shared data.\n- **API Compatibility:** Allows for integration with various applications and services, enhancing functionality in mixed-OS environments.\n- **Extensive Configuration Options:** Offers a wide range of settings to customize file sharing, permissions, and access control.",
  "useCases": "- **Home Networks:** Use Samba to share files between Linux and Windows devices in a home environment.\n- **Small Businesses:** Implement Samba for shared access to files and printers across mixed-OS workgroups.\n- **Enterprise Solutions:** Leverage Samba for large-scale file sharing and collaboration in corporate environments, facilitating cross-platform operations.",
  "support": "- **Community Forums:** Engage with the Samba community for support and discussions through the [Samba Mailing Lists](https://lists.samba.org/).\n- **Documentation:** Comprehensive guides and user manuals are available at the [Samba Documentation](https://www.samba.org/samba/docs/) and the [Samba Wiki](https://wiki.samba.org/index.php/User_Documentation) for detailed reference on setup and configuration.\n- **Troubleshooting Help:** Access the issues section on the [Samba GitHub Repository](https://github.com/samba-team/samba) to report bugs and find community-contributed solutions.\n\nThis template highlights the functionalities and practical applications of Samba, emphasizing its role in enabling file sharing across different operating systems. For more detailed information, visit the [official Samba website](https://www.samba.org/samba/docs/).",
  "nixName": "samba",
  "specs": {
    "ram": 0,
    "storage": 0
  },
  "tags": [],
  "website": "https://www.samba.org",
  "implemented": false,
  "logo": "",
  "options": [
    {
      "name": "configText",
      "desc": "Verbatim contents of smb.conf. If null (default), use the autogenerated file from NixOS instead.",
      "nixName": "configText",
      "type": "null or strings concatenated with \"\\n\"",
      "value": "null"
    },
    {
      "name": "enable",
      "desc": "Whether to enable Samba, which provides file and print services to Windows clients through the SMB/CIFS protocol.  If you use the firewall consider adding the following: services.samba.openFirewall = true;",
      "nixName": "enable",
      "type": "boolean",
      "value": "true"
    },
    {
      "name": "enableNmbd",
      "desc": "Whether to enable Samba’s nmbd, which replies to NetBIOS over IP name service requests. It also participates in the browsing protocols which make up the Windows “Network Neighborhood” view.",
      "nixName": "enableNmbd",
      "type": "boolean",
      "value": "true"
    },
    {
      "name": "enableWinbindd",
      "desc": "Whether to enable Samba’s winbindd, which provides a number of services to the Name Service Switch capability found in most modern C libraries, to arbitrary applications via PAM and ntlm_auth and to Samba itself.",
      "nixName": "enableWinbindd",
      "type": "boolean",
      "value": "true"
    },
    {
      "name": "extraConfig",
      "desc": "Additional global section and extra section lines go in here.",
      "nixName": "extraConfig",
      "type": "strings concatenated with \"\\n\"",
      "value": "\"\""
    },
    {
      "name": "invalidUsers",
      "desc": "List of users who are denied to login via Samba.",
      "nixName": "invalidUsers",
      "type": "list of string",
      "value": "[\n  \"root\"\n]"
    },
    {
      "name": "nsswins",
      "desc": "Whether to enable the WINS NSS (Name Service Switch) plug-in. Enabling it allows applications to resolve WINS/NetBIOS names (a.k.a. Windows machine names) by transparently querying the winbindd daemon.",
      "nixName": "nsswins",
      "type": "boolean",
      "value": "false"
    },
    {
      "name": "openFirewall",
      "desc": "Whether to automatically open the necessary ports in the firewall.",
      "nixName": "openFirewall",
      "type": "boolean",
      "value": "false"
    },
    {
      "name": "package",
      "desc": "The samba package to use.",
      "nixName": "package",
      "type": "package",
      "value": "pkgs.samba"
    },
    {
      "name": "securityType",
      "desc": "Samba security type",
      "nixName": "securityType",
      "type": "one of \"auto\", \"user\", \"domain\", \"ads\"",
      "value": "\"user\""
    },
    {
      "name": "shares",
      "desc": "A set describing shared resources. See man smb.conf for options.",
      "nixName": "shares",
      "type": "attribute set of attribute set of unspecified value",
      "value": "{ }"
    }
  ]
}
