{
  "name": "SearXNG",
  "desc": "Deploy Seaxng to create a self-hosted metasearch engine that aggregates results from various search engines while respecting user privacy. Seaxng allows users to search the web without being tracked or monitored.",
  "longDesc": "Seaxng is an open-source metasearch engine designed to provide users with a comprehensive search experience by pulling results from multiple sources. It emphasizes privacy by not storing user data or tracking search histories.\n\n**Key Features:**\n- **One-Click Deployment:** Quickly set up Seaxng using Docker or other installation methods for easy configuration.\n- **Scalability:** Supports multiple instances and configurations, making it suitable for both personal use and larger networks.\n- **Privacy and Security:** Does not track users or store personal data, providing a secure search environment.\n- **API Compatibility:** Offers an API for integration with other applications, allowing for customized search experiences.\n- **Customizable Interface:** Users can modify the appearance and functionalities of their search engine to meet specific needs.",
  "useCases": "- **Privacy-Conscious Users:** Use Seaxng to search the web without compromising personal data or privacy.\n- **Developers:** Integrate Seaxng into applications to provide users with secure and private search capabilities.\n- **Organizations:** Implement Seaxng for internal use to allow employees to conduct searches without exposing sensitive information to third-party search engines.",
  "support": "- **Community Forums:** Engage with the Seaxng community for support and discussions through the [Seaxng GitHub Repository](https://github.com/seaxng/seaxng).\n- **Documentation:** Comprehensive guides and user manuals are available at the repository for detailed reference on setup and configuration.\n- **Troubleshooting Help:** Access the issues section on GitHub to report bugs and find community-contributed solutions.\n\nThis template highlights the functionalities and practical applications of Seaxng, emphasizing its role in creating a private search experience. For more detailed information, visit the [official Seaxng website](https://github.com/seaxng/seaxng).",
  "tags": ["Search Engines"],
  "website": "https://github.com/searxng/searxng",
  "implemented": false,
  "logo": "",
  "specs": {
    "ram": 0,
    "storage": 0
  },
  "nixName": "searxng",
  "options": [
    {
      "name": "networking/searx.nix",
      "desc": "Limiter settings for SearXNG.For available settings, see the SearXNG schemafile.",
      "nixName": "relatedOption.searx.limiterSettings",
      "type": "attribute set of (JSON value)",
      "value": "{ }"
    },
    {
      "name": "networking/searx.nix",
      "desc": "Configure a local Redis server for SearXNG. This is required if youwant to enable the rate limiter and bot protection of SearXNG.",
      "nixName": "relatedOption.searx.redisCreateLocally",
      "type": "boolean",
      "value": "false"
    },
    {
      "name": "networking/searx.nix",
      "desc": "The searxng package to use.",
      "nixName": "relatedOption.searx.package",
      "type": "package",
      "value": "pkgs.searxng"
    }
  ]
}
