{
  "name": "Sonarr ",
  "desc": "Deploy Sonarr to manage and automate the downloading of TV shows. Sonarr is designed to simplify the process of obtaining episodes from various sources while maintaining a clean and organized library.",
  "longDesc": "Sonarr is an open-source application that acts as a PVR (personal video recorder) for TV series. It allows users to track their favorite shows, automatically download new episodes, and organize their media library.\n\n**Key Features:**\n- **One-Click Deployment:** Easily set up Sonarr using Docker or similar technologies for quick installation and access.\n- **Scalability:** Capable of handling multiple shows and seasons, suitable for personal use or larger media libraries.\n- **Privacy and Security:** Operates on the user's local network, giving them control over their media without relying on third-party services.\n- **API Compatibility:** Integrates with various download clients and media servers via a robust API, enhancing automation and workflow.\n- **Notification System:** Provides alerts and notifications for new episodes, ensuring users never miss an update.",
  "useCases": "- **Media Enthusiasts:** Automate the downloading and organization of TV shows, ensuring a seamless viewing experience.\n- **Families:** Set up a family media server that automatically updates with the latest episodes of favorite shows.\n- **Developers:** Utilize the API to integrate Sonarr with other applications or services, creating a personalized media management solution.",
  "support": "- **Community Forums:** Engage with other Sonarr users through the [Sonarr GitHub Repository](https://github.com/Sonarr/Sonarr) for support and discussions.\n- **Documentation:** Comprehensive guides and setup instructions are available at the [Sonarr Documentation](https://sonarr.tv/) for detailed user reference.\n- **Troubleshooting Help:** Access the Issues section on GitHub for community-contributed solutions and to report any bugs or feature requests.\n\nThis template provides an overview of Sonarr’s functionalities and practical applications, emphasizing its importance in managing and automating TV show downloads. For more detailed information, visit the [official Sonarr website](https://sonarr.tv/).",
  "nixName": "sonarr",
  "specs": {
    "ram": 2048,
    "storage": 0
  },
  "tags": ["Automation"],
  "website": "https://sonarr.tv",
  "implemented": false,
  "logo": "https://sonarr.tv/img/favicon.ico",
  "options": [
    {
      "name": "dataDir",
      "desc": "The directory where Sonarr stores its data files.",
      "nixName": "dataDir",
      "type": "string",
      "value": "/var/lib/sonarr/.config/NzbDrone"
    },
    {
      "name": "enable",
      "desc": "Whether to enable Sonarr.",
      "nixName": "enable",
      "type": "boolean",
      "value": "true"
    },
    {
      "name": "group",
      "desc": "Group under which Sonaar runs.",
      "nixName": "group",
      "type": "string",
      "value": "sonarr"
    },
    {
      "name": "openFirewall",
      "desc": "Open ports in the firewall for the Sonarr web interface",
      "nixName": "openFirewall",
      "type": "boolean",
      "value": "false"
    },
    {
      "name": "package",
      "desc": "The sonarr package to use.",
      "nixName": "package",
      "type": "package",
      "value": "pkgs.sonarr"
    },
    {
      "name": "user",
      "desc": "User account under which Sonaar runs.",
      "nixName": "user",
      "type": "string",
      "value": "sonarr"
    }
  ]
}
