{
  "name": "Squid",
  "desc": "Deploy Squid as a powerful caching proxy server for web clients, enabling enhanced performance, reduced bandwidth usage, and improved security for web traffic. Squid acts as an intermediary between users and the internet, caching content to speed up repeated requests.",
  "longDesc": "Squid is an open-source caching proxy server that supports HTTP, HTTPS, and FTP protocols. It is widely used to cache web content and control access to the internet, improving speed and reducing bandwidth consumption.\n\n**Key Features:**\n- **One-Click Deployment:** Easily set up Squid using Docker or other containerization technologies for rapid deployment.\n- **Scalability:** Efficiently handles thousands of simultaneous connections, making it suitable for both small businesses and large enterprises.\n- **Privacy and Security:** Offers various authentication methods and access controls, enhancing security for web access.\n- **Caching Mechanism:** Reduces latency and bandwidth usage by storing frequently accessed content locally, leading to faster load times for users.\n- **API Compatibility:** Integrates with other applications and services through its flexible configuration options, allowing for custom setups.",
  "useCases": "- **Businesses:** Implement Squid to manage internet usage, restrict access to certain sites, and optimize bandwidth for essential applications.\n- **Educational Institutions:** Use Squid to control and monitor student internet access while providing faster access to educational resources.\n- **Developers:** Leverage Squid to test web applications and improve performance by simulating different network conditions.",
  "support": "- **Community Forums:** Engage with the Squid user community for support and discussions through the [Squid Mailing Lists](http://www.squid-cache.org/Support/mailing-lists.html).\n- **Documentation:** Comprehensive configuration guides and usage instructions are available at the [Squid Official Documentation](http://www.squid-cache.org/Doc/) for detailed reference.\n- **Troubleshooting Help:** Access the Issues section on [Squid GitHub Repository](https://github.com/squid-cache/squid) for community-contributed solutions and to report any bugs or feature requests.\n\nThis template highlights the functionalities and practical applications of Squid, emphasizing its importance in managing web traffic and enhancing performance. For more detailed information, visit the [official Squid website](http://www.squid-cache.org/).",
  "nixName": "squid",
  "specs": {
    "ram": 0,
    "storage": 0
  },
  "tags": ["Proxy"],
  "website": "http://www.squid-cache.org",
  "implemented": false,
  "logo": "",
  "options": [
    {
      "name": "configText",
      "desc": "Verbatim contents of squid.conf. If null (default), use the autogenerated file from NixOS instead.",
      "nixName": "configText",
      "type": "null or strings concatenated with \"\\n\"",
      "value": "null"
    },
    {
      "name": "enable",
      "desc": "Whether to run squid web proxy.",
      "nixName": "enable",
      "type": "boolean",
      "value": "true"
    },
    {
      "name": "extraConfig",
      "desc": "Squid configuration. Contents will be added verbatim to the configuration file.",
      "nixName": "extraConfig",
      "type": "strings concatenated with \"\\n\"",
      "value": "\"\""
    },
    {
      "name": "package",
      "desc": "The squid package to use.",
      "nixName": "package",
      "type": "package",
      "value": "pkgs.squid"
    },
    {
      "name": "proxyAddress",
      "desc": "IP address on which squid will listen.",
      "nixName": "proxyAddress",
      "type": "null or string",
      "value": "null"
    },
    {
      "name": "proxyPort",
      "desc": "TCP port on which squid will listen.",
      "nixName": "proxyPort",
      "type": "signed integer",
      "value": "3128"
    }
  ]
}
