{
  "name": "Tinyproxy",
  "desc": "Deploy Tinyproxy with a streamlined setup to create a lightweight HTTP/HTTPS proxy server. Tinyproxy allows users to route their internet traffic through a proxy, providing privacy, filtering capabilities, and access to restricted content.",
  "longDesc": "Tinyproxy is an open-source, lightweight proxy server designed to be simple and fast. It enables users to bypass internet restrictions, improve privacy, and control web traffic. Tinyproxy supports both HTTP and HTTPS protocols.\n\n**Key Features:**\n- **One-Click Deployment:** Easily deploy Tinyproxy using Docker or other container orchestration tools for quick setup.\n- **Scalability:** Suitable for small to medium-sized environments, supporting multiple concurrent connections.\n- **Privacy and Security:** Masks users' IP addresses, enhancing privacy while browsing the internet.\n- **Customizable Configuration:** Offers extensive configuration options for fine-tuning proxy settings and behavior.\n- **Access Control:** Provides features for managing which clients can use the proxy, improving security.",
  "useCases": "- **Individuals:** Route internet traffic through Tinyproxy for enhanced privacy and access to geo-restricted content.\n- **Businesses:** Implement Tinyproxy to manage and filter employee internet usage and protect sensitive data.\n- **Educators:** Teach network concepts and the workings of proxy servers in computer networking courses.",
  "support": "- **Community Forums:** Connect with the Tinyproxy community for assistance and discussions through the [Tinyproxy GitHub Repository](https://github.com/tinyproxy/tinyproxy).\n- **Documentation:** Comprehensive guides and configuration instructions are available in the [Tinyproxy Documentation](https://tinyproxy.github.io/) for user reference.\n- **Troubleshooting Help:** Access the issues section on GitHub for community-contributed solutions and to report any bugs or feature requests.\n\nThis template provides a clear overview of Tinyproxy’s functionalities and practical applications, emphasizing its importance in managing internet traffic securely. For more detailed information, visit the [official Tinyproxy GitHub page](https://github.com/tinyproxy/tinyproxy).",
  "nixName": "tinyproxy",
  "specs": {
    "ram": 0,
    "storage": 0
  },
  "tags": ["Proxy"],
  "website": "https://tinyproxy.github.io/",
  "implemented": false,
  "logo": "",
  "options": [
    {
      "name": "enable",
      "desc": "Whether to enable Tinyproxy daemon.",
      "nixName": "enable",
      "type": "boolean",
      "value": "true"
    },
    {
      "name": "package",
      "desc": "The tinyproxy package to use.",
      "nixName": "package",
      "type": "package",
      "value": "pkgs.tinyproxy"
    },
    {
      "name": "settings",
      "desc": "Configuration for tinyproxy.",
      "nixName": "settings",
      "type": "attribute set of (atom (null, bool, int, float or string) or a list of them for duplicate keys)",
      "value": "{ }"
    },
    {
      "name": "settings.Anonymous",
      "desc": "If an Anonymous keyword is present, then anonymous proxying is enabled. The headers listed with Anonymous are allowed through, while all others are denied. If no Anonymous keyword is present, then all headers are allowed through. You must include quotes around the headers.",
      "nixName": "settings.Anonymous",
      "type": "list of string",
      "value": "[ ]"
    },
    {
      "name": "settings.Filter",
      "desc": "Tinyproxy supports filtering of web sites based on URLs or domains. This option specifies the location of the file containing the filter rules, one rule per line.",
      "nixName": "settings.Filter",
      "type": "null or path",
      "value": "null"
    },
    {
      "name": "settings.Listen",
      "desc": "Specify which address to listen to.",
      "nixName": "settings.Listen",
      "type": "string",
      "value": "127.0.0.1"
    },
    {
      "name": "settings.Port",
      "desc": "Specify which port to listen to.",
      "nixName": "settings.Port",
      "type": "signed integer",
      "value": "8888"
    }
  ]
}
