{
  "name": "Typesense",
  "desc": "Deploy Typesense to create a fast, open-source search engine designed for instant and relevant results. Typesense is optimized for speed and ease of use, making it ideal for applications that require search functionality.",
  "longDesc": "Typesense is a modern, open-source search engine that focuses on delivering an easy-to-use API for creating powerful search experiences. It is designed to provide relevant search results quickly, with a strong emphasis on performance and developer-friendliness.\n\n**Key Features:**\n- **One-Click Deployment:** Easily set up Typesense using Docker or other containerization methods for straightforward installation.\n- **Scalability:** Capable of handling large datasets and high query volumes, making it suitable for applications ranging from small websites to large enterprise platforms.\n- **Privacy and Security:** Operates locally or on private servers, ensuring that data remains secure and user privacy is protected.\n- **API Compatibility:** Offers a simple RESTful API that allows easy integration into various applications and services.\n- **Faceted Search:** Supports advanced features like faceted search, typo tolerance, and synonyms, enhancing user search experiences.",
  "useCases": "- **Developers:** Integrate Typesense into web applications to provide fast and relevant search results, improving user experience.\n- **E-commerce Platforms:** Use Typesense to power product search and filtering features, enabling customers to find products quickly.\n- **Content Management Systems:** Implement Typesense to enhance search functionality in blogs, documentation sites, or knowledge bases.",
  "support": "- **Community Forums:** Engage with the Typesense community for support and discussions through the [Typesense GitHub Repository](https://github.com/typesense/typesense).\n- **Documentation:** Comprehensive guides and user manuals are available at the [Typesense Documentation](https://typesense.org/docs/) for detailed reference on setup and usage.\n- **Troubleshooting Help:** Access the issues section on GitHub to report bugs and find community-contributed solutions.\n\nThis template provides an overview of Typesense’s functionalities and practical applications, emphasizing its role in creating efficient search experiences. For more detailed information, visit the [official Typesense website](https://typesense.org).",
  "nixName": "typesense",
  "specs": {
    "ram": 0,
    "storage": 0
  },
  "tags": ["Search Engines"],
  "website": "https://typesense.org",
  "implemented": false,
  "logo": "https://typesense.org/favicon.png",
  "options": [
    {
      "name": "apiKeyFile",
      "desc": "Sets the admin api key for typesense. Always use this option instead of settings.server.api-key to prevent the key from being written to the world-readable nix store.",
      "nixName": "apiKeyFile",
      "type": "path",
      "value": ""
    },
    {
      "name": "enable",
      "desc": "Whether to enable typesense.",
      "nixName": "enable",
      "type": "boolean",
      "value": "true"
    },
    {
      "name": "package",
      "desc": "The typesense package to use.",
      "nixName": "package",
      "type": "package",
      "value": "pkgs.typesense"
    },
    {
      "name": "settings",
      "desc": "Typesense configuration. Refer to the documentation for supported values.",
      "nixName": "settings",
      "type": "attribute set of section of an INI file (attrs of INI atom (null, bool, int, float or string) or a non-empty list of them)",
      "value": "{ }"
    },
    {
      "name": "settings.server.api-address",
      "desc": "Address to which Typesense API service binds.",
      "nixName": "settings.server.api-address",
      "type": "string",
      "value": ""
    },
    {
      "name": "settings.server.api-port",
      "desc": "Port on which the Typesense API service listens.",
      "nixName": "settings.server.api-port",
      "type": "16 bit unsigned integer; between 0 and 65535 (both inclusive)",
      "value": "8108"
    },
    {
      "name": "settings.server.data-dir",
      "desc": "Path to the directory where data will be stored on disk.",
      "nixName": "settings.server.data-dir",
      "type": "string",
      "value": "/var/lib/typesense"
    }
  ]
}
