{
  "name": "vaultwarden",
  "desc": "Deploy Vaultwarden to create a self-hosted password manager that securely stores and manages user credentials. Vaultwarden is an efficient alternative to Bitwarden, designed for users who want to maintain control over their password data.",
  "longDesc": "Vaultwarden is an open-source implementation of the Bitwarden API, providing a lightweight server to host your own password manager. It allows users to store, share, and manage passwords and sensitive information securely.\n\n**Key Features:**\n- **One-Click Deployment:** Easily deploy Vaultwarden using Docker, which simplifies the installation and setup process.\n- **Scalability:** Suitable for personal use or larger teams, handling numerous users and passwords efficiently.\n- **Privacy and Security:** Users retain complete control over their data, with end-to-end encryption ensuring that sensitive information remains secure.\n- **API Compatibility:** Fully compatible with the official Bitwarden client apps, allowing for seamless integration and use across various devices.\n- **Web Vault and Extensions:** Offers a web-based interface and browser extensions for easy access to stored passwords.",
  "useCases": "- **Individuals:** Manage personal passwords securely without relying on third-party services.\n- **Small Businesses:** Implement Vaultwarden for team members to share credentials safely and effectively.\n- **Developers:** Integrate Vaultwarden into applications that require secure credential management and access control.",
  "support": "- **Community Forums:** Engage with the Vaultwarden community for support and discussions through the [Vaultwarden GitHub Repository](https://github.com/dani-garcia/vaultwarden) and [Guerzon’s Vaultwarden](https://guerzon.github.io/vaultwarden/).\n- **Documentation:** Comprehensive guides and user manuals are available at the [Vaultwarden Documentation](https://dani-garcia.github.io/vaultwarden/) for detailed reference on setup and configuration.\n- **Troubleshooting Help:** Access the issues section on GitHub to report bugs and find community-contributed solutions.\n\nThis template provides an overview of Vaultwarden’s functionalities and practical applications, emphasizing its role in secure password management. For more detailed information, visit the [official Vaultwarden GitHub page](https://github.com/dani-garcia/vaultwarden).",

  "nixName": "vaultwarden",
  "specs": {
    "ram": 0,
    "storage": 0
  },
  "tags": [],
  "website": "https://github.com/dani-garcia/vaultwarden",
  "implemented": false,
  "logo": "",
  "options": [
    {
      "name": "backupDir",
      "desc": "The directory under which vaultwarden will backup its persistent data.",
      "nixName": "backupDir",
      "type": "null or string",
      "value": "null"
    },
    {
      "name": "config",
      "desc": "The configuration of vaultwarden is done through environment variables, therefore it is recommended to use upper snake case (e.g. DISABLE_2FA_REMEMBER). However, camel case (e.g. disable2FARemember) is also supported: The NixOS module will convert it automatically to upper case snake case (e.g. DISABLE_2FA_REMEMBER). In this conversion digits (0-9) are handled just like upper case characters, so foo2 would be converted to FOO_2. Names already in this format remain unchanged, so FOO2 remains FOO2 if passed as such, even though foo2 would have been converted to FOO_2. This allows working around any potential future conflicting naming conventions. Based on the attributes passed to this config option an environment file will be generated that is passed to vaultwarden’s systemd service. The available configuration options can be found in the environment template file. See services.vaultwarden.environmentFile for how to set up access to the Admin UI to invite initial users.",
      "nixName": "config",
      "type": "attribute set of (null or boolean or signed integer or string)",
      "value": "{\n  ROCKET_ADDRESS = \"::1\";\n  ROCKET_PORT = 8222;\n}"
    },
    {
      "name": "dbBackend",
      "desc": "Which database backend vaultwarden will be using.",
      "nixName": "dbBackend",
      "type": "one of \"sqlite\", \"mysql\", \"postgresql\"",
      "value": "\"sqlite\""
    },
    {
      "name": "enable",
      "desc": "Whether to enable vaultwarden.",
      "nixName": "enable",
      "type": "boolean",
      "value": "true"
    },
    {
      "name": "environmentFile",
      "desc": "Additional environment file as defined in systemd.exec(5). Secrets like ADMIN_TOKEN and SMTP_PASSWORD should be passed to the service without adding them to the world-readable Nix store. Note that this file needs to be available on the host on which vaultwarden is running. As a concrete example, to make the Admin UI available (from which new users can be invited initially), the secret ADMIN_TOKEN needs to be defined as described here: # Admin secret token, see # https://github.com/dani-garcia/vaultwarden/wiki/Enabling-admin-page ADMIN_TOKEN=...copy-paste a unique generated secret token here...",
      "nixName": "environmentFile",
      "type": "null or path",
      "value": "null"
    },
    {
      "name": "package",
      "desc": "The vaultwarden package to use.",
      "nixName": "package",
      "type": "package",
      "value": "pkgs.vaultwarden"
    },
    {
      "name": "webVaultPackage",
      "desc": "Web vault package to use.",
      "nixName": "webVaultPackage",
      "type": "package",
      "value": "pkgs.vaultwarden.webvault"
    }
  ]
}
